Maleehaakbar/i2c_multislave_nrf5/main.c
/**
 * Copyright (c) 2015 - 2021, Nordic Semiconductor ASA
 *
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */
/** @file
 * @defgroup tw_sensor_example main.c
 * @{
 * @ingroup nrf_twi_example
 * @brief TWI Sensor Example main file.
 *
 * This file contains the source code for a sample application using TWI.
 *
 */

#include <stdio.h>
#include "boards.h"
#include "app_util_platform.h"
#include "app_error.h"
#include "nrf_drv_twi.h"
#include "nrf_delay.h"
#include "i2c.h"


#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"
#include "qmc5883l.h"
#include "mpu_6050.h"




/**
 * @brief Function for main application entry.
 */
int main(void)
{   
    char buf[64];
    int16_t g_x,g_y,g_z;
    int16_t a_x, a_y, a_z;
    /*log init*/
    APP_ERROR_CHECK(NRF_LOG_INIT(NULL));  
    NRF_LOG_DEFAULT_BACKENDS_INIT();
  
    /*i2c init*/
    twi_init();   
    NRF_LOG_INFO("\r\n init i2c");
    NRF_LOG_FLUSH();
    
    #if (TEST_QMC58833L)
    APP_ERROR_CHECK(qmc5883l_set_config(QMC5883L_DR_50, QMC5883L_OSR_128, QMC5883L_RNG_2));
    APP_ERROR_CHECK(qmc5883l_set_mode(QMC5883L_MODE_CONTINUOUS));

    while(true)
    {
      nrf_delay_ms(500);
      qmc5883l_data_t data;
        if (qmc5883l_get_data(&data) == NRF_SUCCESS)
        {
          snprintf(buf, sizeof(buf), "Magnetic data: X:%.2f mG, Y:%.2f mG, Z:%.2f mG",data.x, data.y, data.z);
          NRF_LOG_INFO("%s", buf);
        }
        else
        {
            NRF_LOG_INFO("Could not read QMC5883L data\n");
        }
        NRF_LOG_FLUSH();
      if (nrf_result!= NRF_SUCCESS)
        {
          NRF_LOG_INFO("\r\n failed to recv data.");
          NRF_LOG_FLUSH();
          return 1;
        }
 
    }
    #else
   mpu6050_init();
   while(true)
   {

    nrf_delay_ms(500);
    APP_ERROR_CHECK(MPU6050_ReadGyro(&g_x, &g_y ,&g_z));
    APP_ERROR_CHECK(MPU6050_ReadAcc(&a_x, &a_y, &a_z));

    if(nrf_result != NRF_SUCCESS)
    {
          NRF_LOG_INFO("\r\n failed to recv data.");
          NRF_LOG_FLUSH();
          return 1;
    }
    else 
    {
      NRF_LOG_INFO("\r\n gyro data %d. %d, %d", g_x, g_y, g_z);
      NRF_LOG_FLUSH();
      NRF_LOG_INFO("\r\n accelro data %d. %d, %d", a_x, a_y, a_z);
      NRF_LOG_FLUSH();
    }
   }

   #endif

}

/** @} */


//debugging, add other events in event handler, set done flag properly, log properly , (running i2c scanner give 0xd address)
// data received , gives 0, 3 ,FF, should return just 0xff
//as i made connection on breadboard , it stops working(may be due to absence of external pull ups)..direct connection without breadboard works
